elasticsearch-jmeter/testpack/jmeter.log
2017/11/15 01:46:46 INFO  - jmeter.util.JMeterUtils: Setting Locale to en_US 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Loading user properties from: /opt/jmeter/apache-jmeter-3.1/bin/user.properties 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Loading system properties from: /opt/jmeter/apache-jmeter-3.1/bin/system.properties 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Setting System property: PhantomJS_Driver=/usr/local/bin/phantomjs.exe 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Setting Global properties from the file run.properties 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Copyright (c) 1998-2016 The Apache Software Foundation 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Version 3.1 r1770033 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: java.version=1.8.0_151 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: os.name=Linux 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: os.arch=amd64 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: os.version=3.16.0-43-generic 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: file.encoding=UTF-8 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Max memory     =4295491584 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Available Processors =4 
2017/11/15 01:46:46 INFO  - jmeter.JMeter: Default Locale=English (United States) 
2017/11/15 01:46:47 INFO  - jmeter.JMeter: JMeter  Locale=English (United States) 
2017/11/15 01:46:47 INFO  - jmeter.JMeter: JMeterHome=/opt/jmeter/apache-jmeter-3.1 
2017/11/15 01:46:47 INFO  - jmeter.JMeter: user.dir  =/opt/jmeter 
2017/11/15 01:46:47 INFO  - jmeter.JMeter: PWD       =/opt/jmeter 
2017/11/15 01:46:47 INFO  - jmeter.JMeter: IP: 10.0.4.10 Name: jmeter-boss FullName: 10.0.4.10 
2017/11/15 01:46:47 INFO  - jmeter.services.FileServer: Default base='/opt/jmeter' 
2017/11/15 01:46:47 INFO  - jmeter.services.FileServer: Set new base='/opt/jmeter' 
2017/11/15 01:46:47 INFO  - jmeter.save.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2 
2017/11/15 01:46:47 INFO  - jmeter.save.SaveService: Using SaveService properties file encoding UTF-8 
2017/11/15 01:46:47 INFO  - jmeter.save.SaveService: Using SaveService properties version 3.1 
2017/11/15 01:46:47 INFO  - jmeter.save.SaveService: All converter versions present and correct 
2017/11/15 01:46:47 INFO  - jmeter.save.SaveService: Loading file: /opt/jmeter/JMeter_PhantomJS_Template.jmx 
2017/11/15 01:46:47 INFO  - jmeter.samplers.SampleResult: Note: Sample TimeStamps are START times 
2017/11/15 01:46:47 INFO  - jmeter.samplers.SampleResult: sampleresult.default.encoding is set to ISO-8859-1 
2017/11/15 01:46:47 INFO  - jmeter.samplers.SampleResult: sampleresult.useNanoTime=true 
2017/11/15 01:46:47 INFO  - jmeter.samplers.SampleResult: sampleresult.nanoThreadSleep=5000 
2017/11/15 01:46:47 INFO  - jmeter.JMeter: Creating summariser <summary> 
2017/11/15 01:46:47 INFO  - jmeter.engine.DistributedRunner: Configuring remote engine: 10.0.4.20 
2017/11/15 01:46:47 INFO  - jmeter.engine.DistributedRunner: Configuring remote engine: 10.0.4.21 
2017/11/15 01:46:47 INFO  - jmeter.engine.DistributedRunner: Configuring remote engine: 10.0.4.22 
2017/11/15 01:46:47 INFO  - jmeter.engine.DistributedRunner: Configuring remote engine: 10.0.4.23 
2017/11/15 01:46:47 INFO  - jmeter.engine.DistributedRunner: Configuring remote engine: 10.0.4.24 
2017/11/15 01:46:47 INFO  - jmeter.engine.DistributedRunner: Starting remote engines 
2017/11/15 01:46:47 INFO  - jmeter.engine.DistributedRunner: Starting the test @ Wed Nov 15 01:46:47 UTC 2017 (1510710407425) 
2017/11/15 01:46:47 INFO  - jmeter.engine.ClientJMeterEngine: running clientengine run method 
2017/11/15 01:46:47 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must contain the string: '.functions.' 
2017/11/15 01:46:47 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must not contain the string: '.gui.' 
2017/11/15 01:46:47 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2017/11/15 01:46:47 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:47 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:47 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:47 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:47 INFO  - jmeter.engine.ClientJMeterEngine: sent test to 10.0.4.24 basedir='.' 
2017/11/15 01:46:47 INFO  - jmeter.engine.ClientJMeterEngine: Sending properties {clustername=, indexname=ctip, elasticip=10.0.2.100, indexcount=1, batchsize=2000, duration=300, nthreads=8} 
2017/11/15 01:46:47 INFO  - jmeter.engine.ClientJMeterEngine: sent run command to 10.0.4.24 
2017/11/15 01:46:47 INFO  - jmeter.engine.ClientJMeterEngine: running clientengine run method 
2017/11/15 01:46:47 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:47 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:47 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:47 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:47 INFO  - jmeter.JMeter: Started remote host:  10.0.4.24 (1510710407979) 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: sent test to 10.0.4.23 basedir='.' 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: Sending properties {clustername=, indexname=ctip, elasticip=10.0.2.100, indexcount=1, batchsize=2000, duration=300, nthreads=8} 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: sent run command to 10.0.4.23 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: running clientengine run method 
2017/11/15 01:46:48 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:48 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:48 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:48 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:48 INFO  - jmeter.JMeter: Started remote host:  10.0.4.23 (1510710408020) 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: sent test to 10.0.4.20 basedir='.' 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: Sending properties {clustername=, indexname=ctip, elasticip=10.0.2.100, indexcount=1, batchsize=2000, duration=300, nthreads=8} 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: sent run command to 10.0.4.20 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: running clientengine run method 
2017/11/15 01:46:48 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:48 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:48 INFO  - jmeter.JMeter: Started remote host:  10.0.4.20 (1510710408060) 
2017/11/15 01:46:48 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:48 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: sent test to 10.0.4.22 basedir='.' 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: Sending properties {clustername=, indexname=ctip, elasticip=10.0.2.100, indexcount=1, batchsize=2000, duration=300, nthreads=8} 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: sent run command to 10.0.4.22 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: running clientengine run method 
2017/11/15 01:46:48 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:48 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:48 INFO  - jmeter.JMeter: Started remote host:  10.0.4.22 (1510710408089) 
2017/11/15 01:46:48 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2017/11/15 01:46:48 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: sent test to 10.0.4.21 basedir='.' 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: Sending properties {clustername=, indexname=ctip, elasticip=10.0.2.100, indexcount=1, batchsize=2000, duration=300, nthreads=8} 
2017/11/15 01:46:48 INFO  - jmeter.engine.ClientJMeterEngine: sent run command to 10.0.4.21 
2017/11/15 01:46:48 INFO  - jmeter.engine.DistributedRunner: Remote engines have been started 
2017/11/15 01:46:48 INFO  - jmeter.JMeter: Started remote host:  10.0.4.21 (1510710408121) 
2017/11/15 01:47:32 INFO  - jmeter.reporters.Summariser: summary +      4 in 00:00:45 =    0.1/s Avg: 35900 Min: 30394 Max: 41321 Err:     4 (100.00%) Active: 120 Started: 125 Finished: 5 
2017/11/15 01:49:32 INFO  - jmeter.reporters.Summariser: summary +     12 in 00:02:00 =    0.1/s Avg: 86248 Min: 36524 Max: 157755 Err:     8 (66.67%) Active: 102 Started: 125 Finished: 23 
2017/11/15 01:49:32 INFO  - jmeter.reporters.Summariser: summary =     16 in 00:02:45 =    0.1/s Avg: 73661 Min: 30394 Max: 157755 Err:    12 (75.00%) 
2017/11/15 01:50:01 INFO  - jmeter.reporters.Summariser: summary +      1 in 00:00:29 =    0.0/s Avg: 191131 Min: 191131 Max: 191131 Err:     0 (0.00%) Active: 74 Started: 125 Finished: 51 
2017/11/15 01:50:01 INFO  - jmeter.reporters.Summariser: summary =     17 in 00:03:14 =    0.1/s Avg: 80571 Min: 30394 Max: 191131 Err:    12 (70.59%) 
2017/11/15 01:50:05 INFO  - jmeter.JMeter: Finished remote host: 10.0.4.22 (1510710605982) 
2017/11/15 01:50:25 INFO  - jmeter.JMeter: Finished remote host: 10.0.4.24 (1510710625385) 
2017/11/15 01:50:34 INFO  - jmeter.reporters.Summariser: summary +     60 in 00:00:33 =    1.8/s Avg: 179117 Min: 146897 Max: 206759 Err:     2 (3.33%) Active: 28 Started: 125 Finished: 97 
2017/11/15 01:50:34 INFO  - jmeter.reporters.Summariser: summary =     77 in 00:03:47 =    0.3/s Avg: 157360 Min: 30394 Max: 206759 Err:    14 (18.18%) 
2017/11/15 01:50:34 INFO  - jmeter.JMeter: Finished remote host: 10.0.4.23 (1510710634602) 
2017/11/15 01:50:58 INFO  - jmeter.JMeter: Finished remote host: 10.0.4.21 (1510710658499) 
2017/11/15 01:50:59 INFO  - jmeter.reporters.Summariser: summary +     48 in 00:00:24 =    2.0/s Avg: 218365 Min: 184598 Max: 240879 Err:     0 (0.00%) Active: 0 Started: 125 Finished: 125 
2017/11/15 01:50:59 INFO  - jmeter.reporters.Summariser: summary =    125 in 00:04:11 =    0.5/s Avg: 180786 Min: 30394 Max: 240879 Err:    14 (11.20%) 
2017/11/15 01:50:59 INFO  - jmeter.JMeter: Finished remote host: 10.0.4.20 (1510710659004) 
2017/11/15 01:51:04 INFO  - jmeter.JMeter: Interrupting RMI Reaper